<a href="https://colab.research.google.com/github/eswarpoluri/Pandas-Notebook/blob/master/Pandas_Dataframe_Best_Practices.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

What are Best Practices:
1.	Best Practices is not work procedure. Its notes of experience on Do’s and Don’ts and easiest possible approaches.
2.	Avoiding problem approaches which tricks us most of time.
3.	Avoiding functionalities which has bugs in it or when using with cross platforms.
4.	Identifying the easiest approach when multiple approaches are available.

# Notes Summary:

# Datafame
1. Dataframe can be itterable using df.iterrows()
2. Self assign the dataframe to itself when appling functions which dont have inplace option.
    1. df.append()
    2. df.apply()
    3. df.column.map()
    4. ...
3. Count will give total non-na values present in a column. Size will give total row count in a column, even if there are nan values. So use size instead count to know how the length of a DF or sliced dataframe.

# Indexing:
1. Conditional indexing - df.index[]: we can use index function not only to get the total list of    index in a given dataframe, but also get a sliced index using conditional indexing.
    1. df.index - will give the total list of index in a given dataframe
    2. df.index[] - will give a sliced index using conditional indexing
2. Convertion of string index to range index:                                                         
    1. we can get range index only for one value at a time using df.index.get_loc().
    2. use list comprehension get to all / a subset of range index.[df.index.get_loc(i) for i in list(df.index)]
3. Keep drop=True while using df.reset_index to avoid extra column with index in DF.
4. Setting index & setting values
  1. df.set_index - is for setting index name
  2. df.index - is for setting index values
  3. df.index.name - is for setting index name
5. Dataframes with Interval Index is useful for vlookups of data which falls between values of any Interval Index.
6.  Eventhough drop=False by default in reset_index, it is changing to True when used with inplace=True. if we still dont want to drop index while using with inplace=True, then use drop=False
7. set & reset index can be done on multi index by passing it as a list.

# Joining & Merging
1. merge with reference to multiple columns is also possiable. pd.merge(data1, data2, how='left', on=['col1', 'col2'])
2. Difference between different merging opyions.
  1. concat - will join DF on preferred axis (columns / rows)
  2. append - will join DF one below other
  3. merge  - join w.r.t a specific column ie:on=[col1], 
        on=Column (default) or index
        how=inner(inter section)(default), outer(union),left,right
        if rows are not same on merged columns then it will fill with nan values

  4. join: Join columns of another DataFrame.

  5. combine_first - Update null elements with value in the same location in other df

# Filtering and Sorting
1. Shorting with multi columns is possiable by passing list of columns
2. Slicing the datafarame between two values of a column. eg.df[df['score'].between(15, 20)]
3. use df.sample(frac=1) to shaffle the rows in a dataframe.
4. Conditional filtering can be done on columns also eg: df.loc[:, df.columns != 'col2']
5. Using df.column.astype(dtype) we can change the dtype of total column
6. using df.select_dtypes(include = "number"/"object") we can filter columns with datatype
7. Diff b/w "loc", "take" and df slicing-df[[a,b]]
  1. loc can only slice the df but can't rearrange it.
  2. if we want to pick rows / columns of our own order then use take.
  3. df[[3,2,1]] is similar to take, but use of negitive slicing (-1) not posiable
8. Applying or Filtering using String operation will give errors if there are null values. So drop null values before applying any string operations.
9. use all() in combination with isnull() or notnull() to filter the DF with no null or zero vales

# Replacing and Handling Missing Values
1. Replacing values in a Dataframe.
    1. Use df.column.map(dict()) to replace all value in a column with another or same value. values not mentioned in dict will be replaced with nan values.
    2. use replace(['old values'], ['New Value']) for replacing list of values to equivalent list of values.

# Grouping and Aggregating
1. After groupby we can call other columns and apply agg function to it, instead of applying agg functions directly to groupby function

# File Handling
1. keep index = False while writing dataframe to file, unless you need to retain index. Else we will get index as a new column while reading it back to pandas.

    another approach - while reading back the DF from file keep index_id='index name'
2. df.read_clipboard will not work in cloud notebooks, as cant fetch from ur local system. works in local jupyter notebook

# Examples for summary notes

In [ ]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

# Dataframe
Q1. Dataframe can be itterable using df.iterrows()

In [ ]:
for index, i in df.iterrows():
    print(i['name'], i['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
James nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

Q2. Self assign the dataframe to itself when appling functions which dont have inplace option.

  1. df.append()
  2. df.apply()
  3. df.column.map()
  4. ...

Q3. Count will give total non-na values present in a column. Size will give total row count in a column, even if there are nan values. So use size instead count to know how the length of a DF or sliced dataframe.

In [ ]:
df7 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'age': [22,23,24,np.nan,26,27,28,29,30,31],     
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']
                   })
df7

        name   age         city
0  Anastasia  22.0   California
1       Dima  23.0  Los Angeles
2  Katherine  24.0   California
3      James   NaN   California
4      Emily  26.0   California
5    Michael  27.0  Los Angeles
6    Matthew  28.0  Los Angeles
7      Laura  29.0      Georgia
8      Kevin  30.0      Georgia
9      Jonas  31.0  Los Angeles

In [ ]:
df7.groupby('city').age.size()

city
California     4
Georgia        2
Los Angeles    4
Name: age, dtype: int64

In [ ]:
# we should not use count method to calculate no of persons per city. See in California value shows wrong
df7.groupby('city').age.count()

city
California     3
Georgia        2
Los Angeles    4
Name: age, dtype: int64

# Indexing:

Q1. Conditional indexing - df.index[]: we can use index function not only to get the total list of index in a given dataframe, but also get a sliced index using conditional indexing.

  1. df.index - will give the total list of index in a given dataframe
  2. df.index[] - will give a sliced index using conditional indexing

In [ ]:
print(df.index)
l=df.index[df['score'] == 9.0].tolist()
l

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

['b', 'e']

Q2. Convertion of string index to range index:                                                         
  1. we can get range index only for one value at a time using df.index.get_loc().
  2. use list comprehension get to all / a subset of range index.[df.index.get_loc(i) for i in list(df.index)]

In [ ]:
[df.index.get_loc(i) for i in l]

[1, 4]

Q3. Keep drop=True while using df.reset_index to avoid extra column with index in DF

In [ ]:
df.reset_index()

  index       name  score  attempts qualify
0     a  Anastasia   12.5         1     yes
1     b       Dima    9.0         3      no
2     c  Katherine   16.5         2     yes
3     d      James    NaN         3      no
4     e      Emily    9.0         2      no
5     f    Michael   20.0         3     yes
6     g    Matthew   14.5         1     yes
7     h      Laura    NaN         1      no
8     i      Kevin    8.0         2      no
9     j      Jonas   19.0         1     yes

In [ ]:
df.reset_index(drop=True)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Q4. Setting index and index values

In [ ]:
df1 = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})
df1

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [ ]:
df1.index=[1, 2, 3, 4, 5, 6]  # Setting index values

In [ ]:
df1['index']=[1, 2, 3, 4, 5, 6]

# Sol-1
df1.set_index('index')  # Setting index name

      school_code class            name date_Of_Birth  weight  address t_id
index
1            s001     V  Alberto Franco    15/05/2002      35  street1   t1
2            s002     V    Gino Mcneill    17/05/2002      32  street2   t2
3            s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
4            s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
5            s002     V    Gino Mcneill    11/05/2002      31  street2   t5
6            s004    VI    David Parkes    15/09/1997      32  street4   t6

In [ ]:
# Sol-2
df1.index.name='index'   # Setting index name

Q5. Interval Index: Dataframes with Interval Index is useful for vlookups of data which falls between values of any Interval Index.

Example:
Check the student "pass or fail" status and grade, given marks of a student for a subject

In [ ]:
df2 = pd.DataFrame({
    'category': ['Fail','First Class','distinction'],
    'grade': ['0','B','A']
    })
df2

df2.index=pd.IntervalIndex.from_breaks([1, 30, 60, 100], name='Marks_Interval')
df2

                   category grade
Marks_Interval
(1, 30]                Fail     0
(30, 60]        First Class     B
(60, 100]       distinction     A

In [ ]:
df2[df2.index.contains(20)]

               category grade
Marks_Interval
(1, 30]            Fail     0

Q6. Eventhough drop=False by default in reset_index, it is changing to True when used with inplace=True. if we still dont want to drop index while using with inplace=True, then use drop=False

In [ ]:
df2.reset_index(inplace=True, drop=False)

In [ ]:
df2

  Marks_Interval     category grade
0        (1, 30]         Fail     0
1       (30, 60]  First Class     B
2      (60, 100]  distinction     A

Q7. set & reset index can be done on multi index by passing it as a list.

In [ ]:
df2.set_index(['category', 'grade'],inplace=True)
df2

                  Marks_Interval
category    grade
Fail        0            (1, 30]
First Class B           (30, 60]
distinction A          (60, 100]

In [ ]:
df2.reset_index(level=['category', 'grade'])

      category grade Marks_Interval
0         Fail     0        (1, 30]
1  First Class     B       (30, 60]
2  distinction     A      (60, 100]

# Joining & Merging

Q1. merge with reference to multiple columns is also possiable. pd.merge(data1, data2, how='left', on=['col1', 'col2'])

In [ ]:
data1 = pd.DataFrame({'col1': ['K0', 'K0', 'K1', 'K2'],
                     'col2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']})
data1

  col1 col2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3

In [ ]:
data2 = pd.DataFrame({'col1': ['K0', 'K1', 'K1', 'K2'],
                      'col2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})
data2

  col1 col2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3

In [ ]:
pd.merge(data1, data2, how='left', on=['col1', 'col2'])

  col1 col2   P   Q    R    S
0   K0   K0  P0  Q0   R0   S0
1   K0   K1  P1  Q1  NaN  NaN
2   K1   K0  P2  Q2   R1   S1
3   K1   K0  P2  Q2   R2   S2
4   K2   K1  P3  Q3  NaN  NaN

# Filtering and Sorting

Q1. Shorting with multi columns is possiable by passing list of columns

In [ ]:
df.sort_values(by=['name', 'score'], ascending=[False, True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

Q2. Slicing the datafarame between two values of a column.

In [ ]:
df[df['score'].between(15, 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

Q3. use df.sample(frac=1) to shaffle the rows in a dataframe

In [ ]:
df.sample(frac=1)

        name  score  attempts qualify
c  Katherine   16.5         2     yes
b       Dima    9.0         3      no
g    Matthew   14.5         1     yes
a  Anastasia   12.5         1     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes
h      Laura    NaN         1      no
e      Emily    9.0         2      no
d      James    NaN         3      no
i      Kevin    8.0         2      no

In [ ]:
df.loc[:, df.columns != 'attempts']

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

Q4. Conditional filtering can be done on columns also

In [ ]:
df10 = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
df10

  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

In [ ]:
df10.loc[:, df10.columns != 'col2']

  col1
0   C1
1   C1
2   C2
3   C2
4   C2
5   C3
6   C2

Q5. Using df.column.astype(dtype) we can change the dtype of total column

In [ ]:
df10 = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
df10

  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

In [ ]:
df10.col2 = df10.col2.astype(float)
df10

  col1  col2
0   C1   1.0
1   C1   2.0
2   C2   3.0
3   C2   3.0
4   C2   4.0
5   C3   6.0
6   C2   5.0

Q6. using df.select_dtypes(include = "number"/"object") we can filter columns with datatype

In [ ]:
df10.select_dtypes(include = "number")

   col2
0   1.0
1   2.0
2   3.0
3   3.0
4   4.0
5   6.0
6   5.0

Q7. Diff b/w "loc", "take" and df slicing-df[[a,b]]
1. loc can only slice the df but can't rearrange it.
2. if we want to pick rows / columns of our own order then use take.
3. df[[3,2,1]] is similar to take, but use of negitive slicing (-1) not posiable

In [ ]:
df10.take([-1,-2], axis=1) # negitive slicing possiable

   col2 col1
0   1.0   C1
1   2.0   C1
2   3.0   C2
3   3.0   C2
4   4.0   C2
5   6.0   C3
6   5.0   C2

In [ ]:
df10[['col2','col1']]

   col2 col1
0   1.0   C1
1   2.0   C1
2   3.0   C2
3   3.0   C2
4   4.0   C2
5   6.0   C3
6   5.0   C2

Q8. Applying or Filtering using String operation will give errors if there are null values. So drop null values before applying any string operations.

In [164]:
df10.dropna()
df10[df10["col1"].str.contains("C1")]

  col1  col2
0   C1   1.0
1   C1   2.0

Q9. use all() in combination with isnull() or notnull() to filter the DF with no null or zero vales

In [168]:
df10.at[2,'col2']=None
df10.loc[df10.notnull().all(axis=1),:]

  col1  col2
0   C1   1.0
1   C1   2.0
3   C2   3.0
4   C2   4.0
5   C3   6.0
6   C2   5.0

In [169]:
#sol-2
df10.dropna(how='any')

  col1  col2
0   C1   1.0
1   C1   2.0
3   C2   3.0
4   C2   4.0
5   C3   6.0
6   C2   5.0

In [170]:
#keep all rows which has atleast 1 none or zero value.
df10.loc[df10.isnull().sum(axis=1)>0,:]

  col1  col2
2   C2   NaN

In [171]:
# keep columns which has atleat 1 none or zero value.
df10.loc[:,df10.isnull().any()]

   col2
0   1.0
1   2.0
2   NaN
3   3.0
4   4.0
5   6.0
6   5.0

# Replacing and Handling Missing Values

1. Replacing values in a Dataframe.
    1. Use df.column.map(dict()) to replace all value in a column with another or same value. values not mentioned in dict will be replaced with nan values.
    2. use replace(['old values'], ['New Value']) for replacing list of values to equivalent list of values.

In [ ]:
# Map function
# Total column only 2 values yes, No
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [ ]:
# Replace Function
df.name.replace(['Dima','Katherine'],['Dakota Mayi','Demi'])

a      Anastasia
b    Dakota Mayi
c           Demi
d          James
e          Emily
f        Michael
g        Matthew
h          Laura
i          Kevin
j          Jonas
Name: name, dtype: object

# Grouping and Aggregating

Q1. After groupby we can call other columns and apply agg function to it, instead of applying agg functions directly to groupby function

In [ ]:
df10 = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
df10

  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

In [ ]:
df10.groupby('col1')['col2'].apply(list)

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

# File Handling

Q1. keep index = False while writing dataframe to file, unless you need to retain index. Else we will get index as a new column while reading it back to pandas.

In [ ]:
df.to_csv('op.csv')

In [ ]:
pd.read_csv('/content/op.csv') # Unnamed

  Unnamed: 0       name  score  attempts  qualify
0          a  Anastasia   12.5         1     True
1          b       Dima    9.0         3    False
2          c  Katherine   16.5         2     True
3          d      James    NaN         3    False
4          e      Emily    9.0         2    False
5          f    Michael   20.0         3     True
6          g    Matthew   14.5         1     True
7          h      Laura    NaN         1    False
8          i      Kevin    8.0         2    False
9          j      Jonas   19.0         1     True

Q2. df.read_clipboard will not work in cloud notebooks, as cant fetch from ur local system. works in local jupyter notebook